@echo off
title تشغيل منصة انستازون - InstaZone
echo ========================================================
echo جاري تشغيل خادم منصة انستازون لخدمات انستقرام...
echo ========================================================
echo للوصول من الكمبيوتر: http://127.0.0.1:8000
echo للوصول من الجوال (على نفس شبكة الواي فاي): http://192.168.68.110:8000
echo ========================================================
set PATH=C:\xampp\php;%PATH%
start http://127.0.0.1:8000
php artisan serve --host=0.0.0.0 --port=8000
pause
